import { useCallback, useState } from "react";
import { Button, Container, Form } from "react-bootstrap";
import { Wheel } from "react-custom-roulette";
import { WheelData } from "react-custom-roulette/dist/components/Wheel/types";

/**
 * 配列をシャッフルして返却する関数
 * @param array
 * @returns shuffled
 */
const shuffle = <T,>([...array]: T[]) => {
  for (let i = array.length - 1; i >= 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [array[i], array[j]] = [array[j], array[i]];
  }
  return array;
};

function App() {
  // ルーレットの幅
  const [range, setRange] = useState(6);

  // range変更ハンドラ
  const handleChangeRange = useCallback(
    ({ target: { value } }: { target: { value: string } }) =>
      setRange(Number(value)),
    []
  );

  // ルーレットのデータ
  const [data, setData] = useState<WheelData[]>([]);

  // ルーレット生成ボタンハンドラ
  const handleClickGenerate = useCallback(
    () =>
      setData(
        // 配列をシャッフルして
        shuffle(list)
          // rangeで指定した数抽出する
          .slice(0, range)
          .map((value) => ({ option: value }))
      ),
    [range]
  );

  // ルーレットの開始を管理する
  const [start, setStart] = useState(false);
  // ルーレットの当たり
  const [prize, setPrize] = useState<number>(0);

  // SPINボタンクリックハンドラ
  const handleClickSpin = useCallback(() => {
    // ルーレット開始
    setStart((prev) => !prev);
    // 当たりを設定する
    setPrize(Math.floor(Math.random() * data.length));
  }, [data]);

  return (
    <Container>
      {/* タイトル */}
      <h1>ルーレットの旅</h1>
      <h2>東京メトロ・都営地下鉄編</h2>
      <Form>
        {/* いくつルーレットに入れるか */}
        <Form.Group>
          <Form.Label>ルーレットに入れる個数:{range}個</Form.Label>
          <Form.Range
            value={range}
            onChange={handleChangeRange}
            min={1}
            max={list.length}
          />
        </Form.Group>
        {/* ルーレット再生成ボタン */}
        <Button
          size="sm"
          disabled={list.length === 0}
          onClick={handleClickGenerate}
        >
          ルーレット生成
        </Button>
      </Form>
      {/* ルーレット */}
      {data.length > 0 && (
        <Form.Group>
          <Wheel
            data={data}
            mustStartSpinning={start}
            prizeNumber={prize}
            backgroundColors={["#0000ff", "#008000", "#ffd700"]}
          />
          <Button onClick={handleClickSpin}>SPIN</Button>
        </Form.Group>
      )}
    </Container>
  );
}

// 駅名
const list = [
  "浅草駅",
  "田原町駅",
  "稲荷町駅",
  "上野駅",
  "上野広小路駅",
  "末広町駅",
  "神田駅",
  "三越前駅",
  "日本橋駅",
  "京橋駅",
  "銀座駅",
  "新橋駅",
  "虎ノ門駅",
  "溜池山王駅",
  "赤坂見附駅",
  "青山一丁目駅",
  "外苑前駅",
  "表参道駅",
  "渋谷駅",
  "方南町駅",
  "中野富士見町駅",
  "中野新橋駅",
  "新大塚駅",
  "池袋駅",
  "茗荷谷駅",
  "後楽園駅",
  "御茶ノ水駅",
  "本郷三丁目駅",
  "淡路町駅",
  "大手町駅",
  "東京駅",
  "霞ケ関駅",
  "銀座駅",
  "国会議事堂前駅",
  "赤坂見附駅",
  "四ツ谷駅",
  "四谷三丁目駅",
  "新宿御苑前駅",
  "新宿三丁目駅",
  "新宿駅",
  "西新宿駅",
  "中野坂上駅",
  "新中野駅",
  "東高円寺駅",
  "新高円寺駅",
  "南阿佐ケ谷駅",
  "荻窪駅",
  "北千住駅",
  "南千住駅",
  "三ノ輪駅",
  "入谷駅",
  "上野駅",
  "仲御徒町駅",
  "秋葉原駅",
  "小伝馬町駅",
  "人形町駅",
  "茅場町駅",
  "八丁堀駅",
  "築地駅",
  "東銀座駅",
  "銀座駅",
  "日比谷駅",
  "霞ケ関駅",
  "神谷町駅",
  "六本木駅",
  "広尾駅",
  "恵比寿駅",
  "中目黒駅",
  "行徳駅",
  "原木中山駅",
  "南行徳駅",
  "東陽町駅",
  "妙典駅",
  "南砂町駅",
  "西葛西駅",
  "葛西駅",
  "浦安駅",
  "西船橋駅",
  "木場駅",
  "門前仲町駅",
  "茅場町駅",
  "日本橋駅",
  "大手町駅",
  "竹橋駅",
  "九段下駅",
  "飯田橋駅",
  "神楽坂駅",
  "高田馬場駅",
  "早稲田駅",
  "落合駅",
  "中野駅",
  "北綾瀬駅",
  "綾瀬駅",
  "代々木上原駅",
  "代々木公園駅",
  "明治神宮前駅",
  "根津駅",
  "湯島駅",
  "新御茶ノ水駅",
  "大手町駅",
  "二重橋前駅",
  "日比谷駅",
  "国会議事堂前駅",
  "赤坂駅",
  "乃木坂駅",
  "表参道駅",
  "霞ケ関駅",
  "千駄木駅",
  "西日暮里駅",
  "町屋駅",
  "北千住駅",
  "和光市駅",
  "地下鉄成増駅",
  "地下鉄赤塚駅",
  "平和台駅",
  "氷川台駅",
  "小竹向原駅",
  "千川駅",
  "要町駅",
  "池袋駅",
  "東池袋駅",
  "護国寺駅",
  "江戸川橋駅",
  "飯田橋駅",
  "市ケ谷駅",
  "麹町駅",
  "永田町駅",
  "桜田門駅",
  "有楽町駅",
  "銀座一丁目駅",
  "新富町駅",
  "月島駅",
  "豊洲駅",
  "辰巳駅",
  "新木場駅",
  "渋谷駅",
  "表参道駅",
  "青山一丁目駅",
  "永田町駅",
  "半蔵門駅",
  "九段下駅",
  "神保町駅",
  "大手町駅",
  "三越前駅",
  "水天宮前駅",
  "清澄白河駅",
  "住吉駅",
  "錦糸町駅",
  "押上駅",
  "目黒駅",
  "白金台駅",
  "白金高輪駅",
  "麻布十番駅",
  "六本木一丁目駅",
  "溜池山王駅",
  "永田町駅",
  "四ツ谷駅",
  "市ケ谷駅",
  "飯田橋駅",
  "後楽園駅",
  "東大前駅",
  "本駒込駅",
  "駒込駅",
  "西ケ原駅",
  "王子駅",
  "王子神谷駅",
  "志茂駅",
  "赤羽岩淵駅",
  "和光市駅",
  "地下鉄成増駅",
  "地下鉄赤塚駅",
  "平和台駅",
  "氷川台駅",
  "小竹向原駅",
  "千川駅",
  "要町駅",
  "池袋駅",
  "雑司が谷駅",
  "西早稲田駅",
  "東新宿駅",
  "新宿三丁目駅",
  "北参道駅",
  "明治神宮前駅",
  "渋谷駅",
  "西馬込駅",
  "馬込駅",
  "中延駅",
  "戸越駅",
  "五反田駅",
  "高輪台駅",
  "泉岳寺駅",
  "三田駅",
  "大門駅",
  "新橋駅",
  "東銀座駅",
  "宝町駅",
  "日本橋駅",
  "人形町駅",
  "東日本橋駅",
  "浅草橋駅",
  "蔵前駅",
  "浅草駅",
  "本所吾妻橋駅",
  "押上駅",
  "目黒駅",
  "白金台駅",
  "白金高輪駅",
  "三田駅",
  "芝公園駅",
  "御成門駅",
  "内幸町駅",
  "日比谷駅",
  "大手町駅",
  "神保町駅",
  "水道橋駅",
  "春日駅",
  "白山駅",
  "千石駅",
  "巣鴨駅",
  "西巣鴨駅",
  "新板橋駅",
  "板橋区役所前駅",
  "板橋本町駅",
  "本蓮沼駅",
  "志村坂上駅",
  "志村三丁目駅",
  "蓮根駅",
  "西台駅",
  "高島平駅",
  "新高島平駅",
  "西高島平駅",
  "新宿駅",
  "新宿三丁目駅",
  "曙橋駅",
  "市ケ谷駅",
  "九段下駅",
  "神保町駅",
  "小川町駅",
  "岩本町駅",
  "馬喰横山駅",
  "浜町駅",
  "森下駅",
  "菊川駅",
  "住吉駅",
  "西大島駅",
  "大島駅",
  "東大島駅",
  "船堀駅",
  "一之江駅",
  "瑞江駅",
  "篠崎駅",
  "本八幡駅",
  "新宿西口駅",
  "東新宿駅",
  "若松河田駅",
  "牛込柳町駅",
  "牛込神楽坂駅",
  "飯田橋駅",
  "春日駅",
  "本郷三丁目駅",
  "上野御徒町駅",
  "新御徒町駅",
  "蔵前駅",
  "両国駅",
  "森下駅",
  "清澄白河駅",
  "門前仲町駅",
  "月島駅",
  "勝どき駅",
  "築地市場駅",
  "汐留駅",
  "大門駅",
  "赤羽橋駅",
  "麻布十番駅",
  "六本木駅",
  "青山一丁目駅",
  "国立競技場前駅",
  "代々木駅",
  "新宿駅",
  "都庁前駅",
  "西新宿五丁目駅",
  "中野坂上駅",
  "東中野駅",
  "中井駅",
  "落合南長崎駅",
  "新江古田駅",
  "練馬駅",
  "豊島園駅",
  "練馬春日町駅",
  "光が丘駅",
];

export default App;
